Repository: 84000/data-translation-memory
Catalog: toh1-1-v1.tmx
Source language: bo
Languages: en

source: བཀའ་སྩལ་པ། དེ་ལྟ་བས་ན་གང་ན་འདུ་བ་ཡང་མི་མངོན་འགོད་པ་ཡང་མི་མངོན་པ་དེར་
en: The Blessed One then decreed, “A monk should not be forced to account for income and allocations with no obvious source and recipients.

source: ཡང་དགེ་སློང་གིས་གྲངས་འདེབས་སུ་གཞུག་པར་མི་བྱའོ། །གང་ན་འདུ་བ་ནི་མངོན་ལ་འགོད་པ་མི་མངོན་པ་དེར་
en: A monk should not be forced to account for those items for which the receipt is evident but its allocation is obscure.

source: གང་ན་འགོད་པ་ནི་མངོན་ལ་འདུ་བ་མི་མངོན་པ་དེར་ཡང་དགེ་སློང་གིས་གྲངས་འདེབས་སུ་གཞུག་པར་མི་བྱའོ། །
en: A monk should not be forced to account for those items of which the allocation is evident but its receipt is obscure.

source: གང་ན་འདུ་བ་དང་འགོད་པ་མངོན་པ་དེར་ནི་དགེ་སློང་གིས་དྲན་པ་དང་ཤེས་བཞིན་གྱིས་ཚོད་རིག་པར་བྱའོ།།
en: A monk should mindfully and attentively monitor those items of which both the receipt and its allocation are evident.”

source: དེའི་འོག་ཏུ་རྒྱ་མཚོའི་འགྲམ་དུ་སོང་སྟེ་
en: After his encounter with the group of six, the shape-shifting nāga fled to the seashore,

source: གཙུག་ལག་ཁང་རྟ་བབས་མཐོན་པོ་དང་ལྡན་པ། མཐོངས་ཁུང་དང་སྐར་ཁུང་དྲ་བ་ཅན་དང་ལྡན་པ། ལན་ཀན་གྱིས་བརྒྱན་པ། སྙིང་དང་མིག་འཕྲོག་པར་བྱེད་པ། མཐོ་རིས་ཀྱི་ཐེམ་སྐས་སུ་གྱུར་པ། ཁྲི་དང་ཁྲིའུ་དང་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་གཉིས་པ་ཞིག་སྤྲུལ་ཏེ།
en: where he conjured up a second monastery with a high gate, skylights, and latticed windows. It too was adorned with balustrades, beguiling to the heart and beautiful to the eye, with a staircase to the upper level and perfectly outfitted with beds, seats, and supplies.

source: དེར་རྒྱ་མཚོ་ཆེན་པོའི་ཀླུ་དག་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་གི་ཆ་བྱད་ཀྱིས་མངོན་དུ་ལྷགས་ནས་དེ་དག་དེ་ལ་ཆོས་ཉན་པར་བྱེད་དོ།
en: Ocean nāgas, in the guise of brahmins and householders, gathered there and listened to the shape-shifting nāga teach the Dharma.

source: དེ་དག་གིས་དེ་ལ་ཆོས་ཐོས་ནས་དགེ་སློང་གློ་བུར་དུ་འོངས་པ་དང་འགྲོ་བར་ཆས་པ་རྣམས་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་སྟོབས་པར་བྱེད་དོ།
en: After hearing the Dharma, they provided visiting monks and wanderer monks with all the supplies they needed.

source: འདིར་བདག་ཅག་གིས་བྲམ་ཟེ་དང་ཁྱིམ་བདག་འོངས་ཤིང་ལྷགས་པ་རྣམས་ལ་ཡང་ཆོས་བསྟན་པར་བྱ། རྒོལ་བ་དག་ཀྱང་ཚར་གཅད་པར་བྱ། །
en: “Here, it is we who teach the Dharma to the brahmins and householders who come and assemble. It is we who trounce our adversaries and it is we who spread the fame of our order.”

source: རང་གི་གྲགས་པ་ཡང་བསྒྲག་པར་བྱའོ་སྙམ་པས་དྲུག་སྡེ་དག་ལས་གང་ཡང་རུང་བས་རྒྱལ་བྱེད་ཀྱི་ཚལ་གྱི་སྒོ་སྟོང་པར་མི་འཇོག་པས་
en: As the group of six did whatever their self-appointed duties called for, they would never leave the gate into Jetavana unattended.

source: ཉེ་དགའ་ནང་པར་སྔར་ལངས་ཏེ་སོ་ཤིང་བོར་ནས་སྣམ་སྦྱར་དམར་སེར་གྱོན་ཏེ་རྒྱལ་བྱེད་ཀྱི་ཚལ་གྱི་སྒོ་ན་འཆག་ཅིང་འདུག་གོ། །
en: One day, Upananda rose early in the morning, cast aside his toothbrush, donned his orange mantle, and took up his post at the gate into Jetavana.

source: དེས་བསམས་པ། འདི་ནི་དགེ་སློང་གནས་བརྟན་འགའ་ཞིག་ཡིན་གོར་མ་ཆག་སྙན་ནས་
en: Upananda thought, “No doubt this is one of our elder monks.” Going out to greet him,

source: དེས་དེ་བསུ་སྟེ་གནས་བརྟན་བྱོན་པ་ལེགས་སོ་བྱོན་པ་ལེགས་སོ་ཞེས་བྱས་པ་དང་དེས་སྨྲས་པ། སློབ་དཔོན་ཕྱག་འཚལ་ལོ། །
en: he said, “Welcome, elder, welcome.” “Homage to you, instructor.”

source: ཉེ་དགའས་བསམས་པ། ཀྱེ་མ་འདི་ནི་རྒན་ཞུགས་ཤིག་སྟེ། སློབ་དཔོན་ཡང་མི་ཤེས་མཁན་པོ་ཡང་མི་ཤེས་སོ་སྙམ་ནས།
en: Upananda thought, “My! I don’t recognize this retired devotee as one of our instructors, nor do I recognize him as one of our preceptors.”

source: རྒྱ་མཚོའི་འགྲམ་ནས་སོ། །
en: “I’ve come from the seashore.”

source: དེས་སྨྲས་པ། གཙུག་ལག་ཁང་ཡོད་དོ། །
en: “Yes, there is,” he replied.

source: ཅི་དེ་གཙུག་ལག་ཁང་ཡིན་ནམ། འོན་ཏེ་ཕོངས་པ་ཡིན།
en: “What type is it?” “Oh, it is but a poor one.”

source: གང་ན་ཡོ་བྱད་ཐམས་ཅད་དང་ལྡན་པ་ནི་གཙུག་ལག་ཁང་ཡིན་ལ། གང་ན་ཡོ་བྱད་ཐམས་ཅད་དང་བྲལ་བ་དེ་ནི་ཕོངས་པ་ཡིན་ནོ། །
en: If it is fully outfitted, it is a monastery, but if it lacks all the trappings, it is poor.”

source: དེ་ན་དགེ་སློང་ཆོས་སྨྲ་བ་གནས་ཏེ། དེ་དེ་ན་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་ཆོས་སྟོན་པར་བྱེད་ཅིང་
en: “A monk preacher lives there, where he teaches the Dharma to brahmins and householders.

source: དེ་དག་གིས་དེ་ལ་ཆོས་ཐོས་ནས་དགེ་སློང་གློ་བུར་དུ་འོངས་པ་དང་འགྲོ་བར་ཆས་པ་རྣམས་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་སྟོབས་པར་བྱེད་དོ། །
en: After hearing the Dharma, they provide visiting monks and wanderer monks with all the supplies they need.”

source: དྲུག་སྡེ་དག་གི་ཀུན་དུ་སྤྱོད་པ་ནི་གང་ཅུང་ཟད་ཅི་ཐོས་པ་དེ་ཕྱི་འབྲེད་ཀྱི་དུས་ཀྱི་ཚེ་གཅིག་ཏུ་འདུས་ནས་ཕན་ཚུན་རྗོད་པར་བྱེད་པ་ཡིན་པས་
en: As was their wont, when one among the group of six heard the slightest news they all gathered in the afternoon to discuss it.

source: ཉེ་དགའ་གཙུག་ལག་ཁང་དུ་སོང་སྟེ་དྲུག་སྡེ་དག་ལ་སྨྲས་པ།
en: So Upananda went to the assembly hall and said to the group of six,

source: ཚེ་དང་ལྡན་པ་དག་བདག་ཅག་གིས་ཡུན་ཇི་སྲིད་ཀྱིས་བྲེལ་བ་སྤང་བར་བྱ།
en: “We venerables must put off our other business for a time.”

source: ཁྱོད་ཀྱིས་ཐོས་པ་ཅུང་ཞིག་ཡོད་དམ། ཉེ་དགའས་སྨྲས་པ་ཡོད་དེ།
en: “Have you heard some news?” “Indeed I have,” Upananda replied.

source: རྒྱ་མཚོའི་འགྲམ་ན་གཙུག་ལག་ཁང་ཡོད་དོ། །དེ་ན་ཅི་ཡོད།
en: “There is a monastery on the seashore.” “What’s there?”

source: དེ་དག་གིས་དེ་ལས་ཆོས་ཐོས་ནས་དགེ་སློང་གློ་བུར་དུ་འོངས་པ་དང་འགྲོ་བར་ཆས་པ་རྣམས་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་སྟོབས་པར་བྱེད་ཀྱིས།
en: Upon hearing the Dharma from him, they provide visiting monks and wanderer monks with all the supplies they need.

source: དེ་དག་དེར་དོང་བ་དང་། དེས་དེ་དག་ཐག་རིང་པོ་ཁོ་ན་ནས་འོང་བ་མཐོང་ནས་
en: The debarred nāga, now disguised as a monk preacher, saw the six approaching from off in the distance,

source: དེས་བསམས་པ། གནས་ངན་ལེན་ཀུན་དུ་སྤྱོད་པ་དེ་དག་འདིར་ཡང་འོངས་སོ་སྙམ་མོ། །
en: and thought, “Ah! Those rogues have arrived.

source: དེས་ཡང་བསམས་པ། བདག་འདི་དག་ལ་ཅུང་ཟད་ཀྱང་རག་ལུས་པ་མེད་ན་འདི་དག་གིས་བདག་ལ་ཅི་བྱར་ཡོད་སྙམ་མོ། །
en: What would they do if I refused to demurely acquiesce to them?”

source: དེས་ནས་རྒྱ་མཚོ་ཆེན་པོའི་ཀླུ་ད་དག་བྲམ་ཟེ་དང་ཁྱིམ་བདག་གི་ཆ་ལུགས་ཀྱིས་མངོན་དུ་ལྷགས་པ་དང་། དེས་དེ་དག་ལ་ཆོས་བསྟན་ཏོ། །
en: The ocean nāgas, in the guise of brahmins and householders, then gathered there and he taught them the Dharma.

source: དེ་དག་གིས་དེ་ལས་ཆོས་ཐོས་ནས་དགེ་སློང་གློ་བུར་དུ་འོངས་པ་དང་འགྲོ་བར་ཆས་པ་རྣམས་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྟབས་པ་དང་དྲུག་སྡེ་
en: After hearing the Dharma, they provided the visiting monks and wanderer monks with all the supplies they needed,

source: དག་གིས་སྨྲས་པ། དགའ་བོ་ཉེ་དགའ་རྒན་ཞུགས་འདིས་ཅི་ཞིག་ཤེས།
en: at which point the group of six said, “Nanda and Upananda, what does this retired devotee know?”

source: གཅིག་ལས་འཕྲོས་པའོ། །
en: “The Ekottarikāgama

source: འདི་ནི་རེ་ཞིག་རྫུབས་པས་གཅིག་ལས་འཕྲོས་པའི་ཆོས་སྟོན་གྱིས་དགེ་སློང་འདི་དག་ནི་སྡེ་སྣོད་གསུམ་དང་ལྡན་པ། ཆོས་སྒྲོགས་པ། རིགས་པ་དང་གྲོལ་བའི་སྤོབས་པ་ཅན་ཤ་སྟག་ཡིན་ན། ཅིའི་ཕྱིར་འདི་དག་ལ་གསོལ་བ་མི་འདེབས།
en: “If these monks here are all versed in the three piṭakas, are teachers of Dharma in their own right, and possessed of intelligence and untrammeled confidence, why does he, a savant who can only teach the Ekottarikāgama, not request teachings from them?”

source: དེ་དག་གིས་དེ་ལ་སྨྲས་པ། རྒན་ཞུགས་ཁྱོད་ཀྱིས་ཅི་ཤེས། དེས་སྨྲས་པ། །
en: They said to the nāga, disguised as the monk preacher, “What do you know, retired devotee?”

source: དེ་དག་གིས་སྨྲས་པ། རྒན་ཞུགས་ཁྱོད་ནི་རེ་ཞིག་རྫུབས་པས་གཅིག་ལས་འཕྲོས་པའི་ཆོས་སྟོན་གྱི།
en: “You are a savant who only teaches the Ekottarikāgama while

source: དགེ་སློང་འདི་དག་ནི་སྡེ་སྣོད་གསུམ་དང་ལྡན་པ། ཆོས་སྒྲོགས་པ། རིགས་པ་དང་གྲོལ་བའི་སྤོབས་པ་ཅན་ཤ་སྟག་ཡིན་ན།
en: these monks here are all versed in the Three Piṭakas, are teachers of Dharma in their own right, and possessed of intelligence and untrammeled confidence,

source: ཅིའི་ཕྱིར་འདི་དག་ལ་གསོལ་བ་མི་འདེབས།
en: Why do you not request teachings from them?”

source: དེས་སྨྲས་པ། འཕགས་པ་དག་བདག་གིས་བཟློག་གམ་ཅི་ན་ཁྱེད་ཅིའི་ཕྱིར་ཆོས་མི་སྟོན།
en: “What? Nobles ones, do I stop them? Why do you not teach the Dharma?”

source: དེ་དག་གིས་སྨྲས་པ། དགའ་བོ་ཉེ་དགའ་རྒན་ཞུགས་འདི་བདག་ཅག་དང་མི་མཐུན་པར་བྱེད་ཀྱིས་གནས་ནས་དབྱུང་བའི་ལས་བྱའོ། །
en: “Nanda and Upananda, this retired devotee is at odds with us. We will act to evict him.”

source: དེས་བསམས་པ། གལ་ཏེ་བདག་ལ་གནས་ནས་དབྱུང་བའི་ལས་བྱས་ན་ཀླུའི་གནས་སུ་ཡང་སྐབས་མི་རྙེད་དོ་སྙམ་ནས་
en: Thinking, “If they move to evict me, I won’t find a place among the nāgas either,”

source: དེས་དེ་དག་ཉལ་བ་དང་གཙུག་ལག་ཁང་དེ་ཡང་མི་སྣང་བར་བྱས་ཏེ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་སོ། །
en: then, while the group of six were sleeping, the nāga made the monastery vanish and slipped into the ocean.

source: དེ་དག་བྱེ་མའི་ཐང་ལ་ཉལ་ཞིང་འཁོད་འཁོད་ནས་སྨྲས་པ།
en: On waking on the sandy beach, the group of six said,

source: དགའ་བོ་ཉེ་དགའ་ལོངས་ལ་སེང་གེའི་ཁྲི་ཤོམས་ཤིག་དང་ཆོས་བསྟན་པར་བྱའོ། །
en: “Nanda and Upananda, get up and erect a lion throne from which we shall teach the Dharma.”

source: དེ་དག་གིས་ཇི་ཙམ་ན་བདག་ཅག་བྱེ་མའི་ཐང་ལ་ཉལ་བ་མཐོང་ནས་དེ་དག་གིས་སྨྲས་པ།
en: When they noticed they had slept on a sandy beach, they said,

source: བཅོམ་ལྡན་འདས་ལ་མངོན་པར་དད་པ། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་མཆོད་པ་བྱེད་པ་ཞིག་བདག་ཅག་གིས་ཐོ་བཙམས་ནས་གཙུག་ལག་ཁང་མི་སྣང་བར་བྱས་ཏེ་སོང་བ་དེ་
en: “We opposed one who trusted in the Blessed One and served the Buddha, Dharma, and Saṅgha, causing him to flee and make his monastery disappear.”

source: ལྷའམ། ཀླུ་འམ། གནོད་སྦྱིན་ནམ། སུ་ཡིན་ཞེས་ཟེར་བའི་སྐབས་དེ་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ་དང་།
en: When the monks asked the Blessed One, “Who was this being? A god, a nāga, a yakṣa?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དགེ་སློང་ཆོས་སྨྲ་བ་དེ་ནི་སྤྲུལ་པ་གང་ཡིན་པ་དེ་ཉིད་ཡིན་ཏེ།
en: he Blessed One replied, “That monk preacher was a shape-shifter and yet this was so:

source: ཉེས་དམིགས་གང་ཅི་བྱུང་བ་དེ་ནི་དགེ་སློང་དག་མ་གསོལ་བར་ཆོས་སྟོན་པར་བྱེད་པ་ལས་གྱུར་པ་ཡིན་ནོ་སྙམ་ནས་བཀའ་སྩལ་པ།
en: “All those shortcomings ensue from the monks’ teaching without being requested to do so.”

source: དེ་ལྟ་བས་ན་དགེ་སློང་གིས་མ་གསོལ་བར་ཆོས་བསྟན་པར་མི་བྱའོ། །
en: With that he said, “A monk should not teach without first having been asked to do so.

source: དགེ་སློང་མ་གསོལ་བར་ཆོས་སྟོན་ན་འགལ་ཚབས་ཅན་དུ་འགྱུར་རོ། །
en: If a monk teaches without first having been asked to do so, a serious breach occurs.

source: དེའི་ངོར་མགྲོན་དུ་བོས་པ་ལ་ནི་ལྟུང་བ་མེད་དོ། །
en: If he is invited to do so, then no transgression ensues.”

source: མཉན་ཡོད་ན་ཁྱིམ་བདག་སངས་རྒྱས་འཚོ་ཞེས་བྱ་བ་ཕྱུག་པ་ནོར་མང་བ་ལོངས་སྤྱོད་ཆེ་བ་ཞིག་འདུག་པ་
en: Buddharakṣita, a wealthy householder with much riches and goods who lived in Śrāvastī,

source: དེས་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ནས་དེ་དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་དོ། །
en: took a wife of equal caste and together they sported, made love, and indulged all of their desires.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གདུལ་བ་ལ་ལྟོས་པས་དེའི་ཁྱིམ་དུ་སོང་སྟེ།
en: Looking to guide them, the venerable Śāriputra went to their house and

source: དེས་ཁྱིམ་བདག་དེ་ཆུང་མ་དང་བཅས་པ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་དག་ལ་བཞག་གོ། །
en: enjoined the householder and his wife to seek refuge and pledge to uphold the precepts.

source: ཇི་ཙམ་ན་དུས་གཞན་ཞིག་ན་ཁྱིམ་བདག་དེའི་ཆུང་མ་ལ་སེམས་ཅན་ཞུགས་པར་གྱུར་ཏོ། །
en: Some time afterwards, the householder’s wife conceived a child.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སེམས་ཅན་དེ་ངེས་པར་སྐལ་བ་དང་ལྡན་པ་ཉིད་དུ་ཤེས་ནས་
en: Knowing this being was certain to become one of the fortunate, the venerable Śāriputra

source: ཕྱི་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་མེད་པར་དེའི་ཁྱིམ་དུ་སོང་བ་དང་ཁྱིམ་བདག་དེས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སྨྲས་པ།
en: visited the family without any ascetic attendants in his wake. Prostrating at his feet, the householder asked,

source: ཅི་འཕགས་པ་ལ་སླད་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་མ་མཆིས་སམ། །
en: “Does the noble one have no ascetic attendants?”

source: དེས་སྨྲས་པ། ཁྱིམ་བདག་ཅི་ཁོ་བོའི་ཕྱི་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་རྩྭ་ཀ་ཤའི་བྱིངས་སམ། ཀུ་ཤའི་བྱིངས་ནས་འབྱུང་བར་འགྱུར་རམ།
en: “Householder,” he replied, “do you think my ascetic attendants simply sprout up like weeds?

source: འདི་ལྟར་ཁྱོད་ལྟ་བུ་དག་ལས་ཐོབ་པ་གང་དག་ཡིན་པ་དེ་དག་ཁོ་བོའི་ཕྱི་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་དུ་འགྱུར་རོ།
en: It’s those who issue from people like you who become my ascetic attendants.”

source: འཕགས་པ་བདག་གི་མཆིས་འབྲང་འདི་ལ་སེམས་ཅན་ཞིག་ཞུགས་པར་གྱུར་གྱིས།
en: “Noble one, my spouse has conceived a child.

source: གལ་ཏེ་བུ་ཕོ་ཞིག་བཙས་པར་གྱུར་ན་དེ་བདག་གིས་འཕགས་པའི་སླད་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་དུ་འབུལ་ལོ།
en: If she should give birth to a boy, I will offer him as an ascetic attendant to the noble one.”

source: དེས་སྨྲས་པ། ཁྱིམ་བདག་ཐབས་ཡིན་ནོ། །
en: “Householder, I accept.”

source: དེ་ཟླ་བ་བརྒྱད་དམ་དགུ་འདས་པ་དང་ཁྱེའུ་གཟུགས་བཟང་བ། བལྟ་ན་སྡུག་པ།
en: After eight or nine months had passed a boy was born, well proportioned, pleasing to the eye,

source: མཛེས་པ། གསལ་བ། གསེར་གྱི་མདོག་འདྲ་བ། མགོ་གདུགས་ལྟ་བུ་དང་ལྡན་པ།
en: handsome, radiant, with a golden complexion, a head shaped well like a parasol,

source: ལག་པ་རིང་བ། དཔྲལ་བའི་དབྱེས་ཆེ་བ། སྨིན་མ་འཇར་བ། སྣའི་གཟངས་མཐོ་བ་ཞིག་བཙས་སོ། །
en: long arms, a broad forehead, eyebrows that meet, and a prominent nose.

source: བཙས་ནས་དེའི་ཉེ་དུ་དག་འདུས་ཤིང་ལྷགས་ནས་དེ་ཉི་མ་བདུན་གསུམ་ཉི་ཤུ་གཅིག་ཏུ་བཙས་པའི་བཙས་སྟོན་རྒྱ་ཆེར་བྱས་ནས་
en: Three weeks, or twenty-one days, after the birth, relatives came and gathered

source: ཁྱེའུ་མིང་ཅིར་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དོ། །
en: to celebrate his birth in grand style, during which time they discussed what name should be chosen for the boy.

source: གཞན་དག་གིས་སྨྲས་པ། ཁྱེའུ་འདི་སངས་རྒྱས་འཚོའི་བུ་ཡིན་པས་ཁྱེའུ་འི་མིང་དགེ་འདུན་འཚོར་གདགས་སོ་ཞེས་དེའི་མིང་དགེ་འདུན་འཚོ་ཞེས་བྱ་བར་བཏགས་སོ། །
en: Some said, “Since the boy is Buddharakṣita’s son, the boy should be named Saṅgharakṣita,” and thus he was named Saṅgharakṣita.

source: དེ་དག་གིས་ཁྱེའུ་དགེ་འདུན་འཚོ་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་སྙིང་གུ་དང་། གཞན་ཡང་ཡོ་བྱད་ཀྱི་བྱེ་བྲག་གཙོ་བོ་གཙོ་བོ་དག་གིས་སྲིང་བར་བྱེད། སྐྱེད་པར་བྱེད་ཅིང་རྫིང་ན་གནས་པའི་པད་མ་བཞིན་དུ་མྱུར་དུ་སྐྱེད་པར་བྱེད་དོ། །
en: Fortified with milk, curd, butter, ghee, cream, and other nourishing foods, the boy Saṅgharakṣita grew quickly, shooting up like a lotus in a pond.

source: གང་ཁོ་ནའི་ཉིན་མོ་དགེ་འདུན་འཚོ་བཙས་པ་དེ་ཁོ་ནའི་ཉིན་མོ་ཚོང་པ་ལྔ་བརྒྱ་དག་གི་བུ་དག་ཀྱང་བཙས་ཏེ།
en: On the very day Saṅgharakṣita was born, that same day sons were also born to five hundred merchants,

source: དེ་དག་ཀྱང་རིགས་དང་མཐུན་པའི་མིང་དག་བཏགས་སོ། །
en: each of whom was given a name appropriate to his patrilineage.

source: གང་གི་ཚེ་ཁྱེའུ་དགེ་འདུན་འཚོ་ཆེན་པོར་གྱུར་པ་དེའི་ཚེ་ན་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་དེ་རབ་ཏུ་དབྱུང་བའི་དུས་ཤེས་ནས་
en: In time the boy Saṅgharakṣita grew up and the venerable Śāriputra knew it was time to allow his going forth.

source: གདུལ་བ་ལ་ལྟོས་པས་ཕྱི་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་མེད་པར་གཅིག་པུ་དེའི་ཁྱིམ་དུ་སོང་བ་དང་
en: So, looking to guide them, he went alone without any ascetic attendants in his wake to the boy’s house.

source: ཁྱིམ་བདག་སངས་རྒྱས་འཚོས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སྟན་བཏིང་བ་དང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འདུག་གོ།
en: After prostrating at Śāriputra’s feet, the householder Buddharakṣita laid out a seat and invited the venerable Śāriputra to sit.

source: འདུག་ནས་ཀྱང་ཁྱིམ་བདག་སངས་རྒྱས་འཚོ་ལ་བརྡ་བྱ་བར་བརྩམས་སོ།
en: As he sat, Śāriputra signaled to prompt the householder Buddharakṣita.

source: དེ་ནས་ཁྱིམ་བདག་སངས་རྒྱས་འཚོས་དགེ་འདུན་འཚོ་ལ་སྨྲས་པ། །
en: The householder Buddharakṣita then said to Saṅgharakṣita,

source: བུ་ཁོ་བོས་ཁྱོད་མའི་རུམ་ན་འདུག་ཅིང་མ་བཙས་པ་ཉིད་ནས་
en: “Son, when you were in your mother’s womb, before you were even born,

source: འཕགས་པ་ཤཱ་རིའི་བུ་ལ་ཕྱི་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་དུ་ཕུལ་གྱིས་ཁྱོད་སོང་ལ་འདི་ལ་བསྙེན་བཀུར་གྱིས་ཤིག །
en: I offered you as an ascetic attendant to the noble Śāriputra. Go and serve him.”

source: དེ་སེམས་ཅན་སྲིད་པ་ཐ་མ་པ་ཡིན་པས་འཛུམ་སྔོན་དུ་བཏང་སྟེ།
en: As this was to be Saṅgharakṣita’s last life as a sentient being, a smile had already spread across his face and,

source: འཇིགས་པ་མེད་ཅིང་བཞིན་ཉམས་པ་མེད་པ་དང་། དམན་པ་མེད་པས་དེ་ལྟར་བགྱིའོ་ཞེས་ཁས་བླངས་ནས་
en: without apprehension, neither crestfallen nor gloomy, he pledged to do as he was told.

source: དེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་ཕྱི་བཞིན་ཕྱི་བཞིན་རྗེས་སུ་འབྲང་ངོ་། །
en: With that he became the venerable Śāriputra’s attendant apprentice and follower.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་དེ་རབ་ཏུ་བྱུང་ཞིང་བསྙེན་པར་རྫོགས་པར་བྱས་ནས་
en: After the venerable Śāriputra had allowed his going forth and given him ordination,

source: ཀུན་དུ་སྤྱོད་པའི་ཆོས་དག་བསླབས་ཏེ་ལུང་བཞི་ཀློག་ཏུ་བཅུག་གོ། །
en: he taught Saṅgharakṣita how Dharma practitioners conduct themselves and made him recite the Four Āgamas.

source: ཇི་ཙམ་དུས་གཞན་ཞིག་ན།
en: Some time later,

source: ཚོང་པ་ལྔ་བརྒྱ་པོ་དག་གི་བུ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་ཕན་ཚུན་གྲོས་བྱས་ཏེ་རྒྱ་མཚོ་ཆེན་པོར་འདོང་བའི་ཟོང་སྟ་གོན་བྱས་ནས་རྒྱ་མཚོ་ཆེན་པོར་འཕགས་པ་དང་།
en: after assembling merchandise to bring on their journey across the ocean, the five hundred sons of the five hundred merchants conferred and decided to bring, along with their goods, a noble monk across the ocean.

source: དེ་དག་འདི་སྙམ་སེམས་ཏེ། ཤེས་ལྡན་དག་རྒྱ་མཚོ་ཆེན་པོ་ནི་འཇིགས་པ་དུ་མས་ཀུན་དུ་གང་བ་ཡིན་པས་
en: “Gentlemen , the ocean is full of many terrors.

source: བདག་ཅག་གིས་གང་བདག་ཅག་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་དོང་བ་རྣམས་ལ་ཆོས་སྟོན་པར་འགྱུར་བའི་འཕགས་པ་འགའ་ཞིག་གཤེགས་སུ་གསོལ་ན། དེས་བདག་ཅག་བདེ་ལེགས་སུ་འགྱུར་སྙམ་ནས།
en: So those of us that journey across the ocean would do well to ask for the company of a noble one who might teach us the Dharma.”

source: དེ་དག་གིས་དཔྱད་པར་བརྩམས་ཏེ་སྨྲས་པ། སུ་གཤེགས་སུ་གསོལ།
en: Beginning their search, they asked, “Who shall we ask to come?”

source: གཞན་དག་གིས་སྨྲས་པ། །
en: Some answered,

source: ཤེས་ལྡན་དག་འཕགས་པ་དགེ་འདུན་འཚོ་འདི་བདག་ཅག་གི་ནེའུ་ལྡངས་ལྷན་ཅིག་སྐྱེས་པས་རྡུལ་ལ་ལྷན་ཅིག་རྩེ་རྩེ་བ་ཡིན་པས་བདག་ཅག་གིས་འདི་ལ་གསོལ་བ་གདབ་པར་བྱའོ།
en: “Gentlemen , we should ask our peer, the noble Saṅgharakṣita, for we grew up together playing in the dirt with him.”

source: དེ་ནས་དེ་དག་དེའི་གན་དུ་སོང་སྟེ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་སྨྲས་པ།
en: They went to him, prostrated at his feet, and said,

source: འཕགས་པ་དགེ་འདུན་འཚོ་བདག་ཅག་གི་ནེའུ་ལྡངས་ལྷན་ཅིག་སྐྱེས་པ་ས་རྡུལ་ལ་ལྷན་ཅིག་རྩེ་རྩེ་བ་ལགས་ཏེ།
en: “Noble Saṅgharakṣita, we grew up together playing in the dirt with you, our peer,

source: བདག་ཅག་ནི་རྒྱ་མཚོ་ཆེན་པོར་འཕགས་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་འཇིགས་པ་དུ་མས་ཀུན་དུ་གང་བ་ལགས་པས་
en: so if we set out upon the ocean, an ocean full of many terrors,

source: འཕགས་པས་བདག་ཅག་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་མཆིས་པ་རྣམས་ལ་ཆོས་བསྟན་ན་དེས་བདག་ཅག་བདེ་ལེགས་སུ་འགྱུར་བ་ལགས་ཀྱིས།
en: we would do well were the noble one to teach Dharma to those of us crossing the ocean.

source: དེའི་སླད་དུ་འཕགས་པ་བདག་ཅག་དང་ཐབས་ཅིག་རྒྱ་མཚོ་ཆེན་པོར་གཤེགས་པར་གསོལ།
en: Therefore, noble one, we ask that you come with us across the ocean.”

source: དེས་སྨྲས་པ། ཤེས་ལྡན་དག་ཁོ་བོ་ལ་རང་དབང་མེད་ཀྱིས་དེང་ལ་མཁན་པོ་ལ་ཞུས་ཤིག །
en: “Gentlemen ,” he replied, “as I am not at liberty to do as I please, you should put your request to my preceptor.”

source: དེ་དག་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་རྐང་པ་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: They went to the venerable Śāriputra, bowed their heads at his feet, and said,

source: འཕགས་པ་ཤཱ་རིའི་བུ་མཁྱེན་པར་མཛོད་ཅིག །
en: “Noble Śāriputra, please give us your attention.

source: འཕགས་པ་དགེ་འདུན་འཚོ་འདི་བདག་ཅག་གི་ནེའུ་ལྡངས་ལྷན་ཅིག་སྐྱེས་པ་ས་རྡུལ་ལ་ལྷན་ཅིག་རྩེ་རྩེ་བ་ལགས་ཏེ།
en: We grew up together playing in the dirt with our peer, the noble Saṅgharakṣita.

source: བདག་ཅག་ནི་རྒྱ་མཚོ་ཆེན་པོར་འཕགས་ན་
en: So if we set out upon the ocean,

source: རྒྱ་མཚོ་ཆེན་པོ་ནི་འཇིགས་པ་དུ་མས་
en: an ocean full of many terrors,

source: ཀུན་དུ་གང་བ་ལགས་པས་འཕགས་པ་དགེ་འདུན་འཚོས་བདག་ཅག་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་མཆིས་པ་རྣམས་ལ་ཆོས་བསྟན་ན་དེས་བདག་ཅག་བདེ་ལེགས་སུ་འགྱུར་ལགས་ཀྱིས།
en: we would do well were the noble one to teach Dharma to those of us crossing the ocean.

source: དེའི་སླད་དུ་འཕགས་པ་དགེ་འདུན་འཚོ་བདག་ཅག་དང་ཐབས་ཅིག་རྒྱ་མཚོ་ཆེན་པོར་གཏང་བར་གསོལ།
en: For that reason, we ask that you send the noble Saṅgharakṣita with us across the ocean.”

source: དེས་སྨྲས་པ། བཅོམ་ལྡན་འདས་ཉིད་ལ་ཞུས་ཤིག་དང་ཁོ་བོས་ཟློག་པར་མི་བྱེད་དོ། །
en: “Ask the Blessed One himself and I will not object.”

source: དེ་དག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: They went to the Blessed One, bowed their heads at his feet, and said,

source: བཅོམ་ལྡན་འདས་མཁྱེན་པར་མཛད་དུ་གསོལ།
en: “Blessed One, please give us your attention.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། ཅི་ཚོང་པ་འདི་དག་ལ་དགེ་བའི་རྩ་བ་ཅུང་ཟད་ཡོད་དམ། འོན་ཏེ་མེད་སྙམ་ན་ཡོད་པར་གཟིགས་སོ། །
en: The Blessed One considered whether or not these merchants had any meager roots of virtue and saw that they did.

source: སུ་ལ་རག་ལུས་སྙམ་ནས་དགེ་སློང་དགེ་འདུན་འཚོ་ལ་རག་ལུས་པར་གཟིགས་ནས།
en: Considering who their awakening hinged on, he saw that it hinged on the monk Saṅgharakṣita.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then said to the venerable Saṅgharakṣita,

source: དགེ་འདུན་འཚོ་ཁྱོད་རྒྱ་མཚོ་ཆེན་པོར་འཇུག་ཏུ་སོང་ལ་ཁྱོད་ཀྱིས་འཇིགས་པ་དང་འཇིགས་སུ་རུང་བ་དག་བཟོད་པར་གྱིས་ཤིག །
en: “Saṅgharakṣita, you shall go on this journey across the ocean and face your fears along with what provokes them.”

source: ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོས་བཅོམ་ལྡན་འདས་ལ་ཅང་མི་སྨྲ་བར་དང་དུ་བླངས་སོ། །
en: With his silence, the venerable Saṅgharakṣita assented to the Blessed One.

source: དེ་ནས་ཚོང་པ་ལྔ་བརྒྱ་པོ་དེ་དག་ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོ་དང་ལྷན་ཅིག་དགེ་མཚན་དང་། བཀྲ་ཤིས་དང་། བདེ་ལེགས་སུ་འགྱུར་བ་དག་བྱས་ཏེ།
en: After performing rites for protection, good luck, and success, the five hundred merchants together with the venerable Saṅgharakṣita

source: ཤིང་རྟ་དག་དང་། ཁུར་དག་དང་། སྤྱད་དག་དང་། གླེ་བ་དག་དང་། རྔ་མོ་དག་དང་། བ་ལང་དག་དང་། བོང་བུ་དག་གིས་རྒྱ་མཚོ་ཆེན་པོར་འདོང་བའི་ཟོང་ཁྱེར་ཏེ།
en: carried their goods to the ocean in carts, on poles, in baskets and hampers, and on camels, bullocks, and donkeys.

source: རྒྱ་མཚོ་ཆེན་པོར་འཕགས་ནས་མཐར་གྱིས་གྲོང་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དང་། ཚོང་རྡལ་དག་ཏུ་རྣམ་པར་རྒྱུ་བ་ན་རྒྱ་མཚོ་ཆེན་པོའི་འགྲམ་དུ་ཕྱིན་ནས་
en: Setting out for the ocean, they passed in stages through villages, towns, countryside, kingdoms, and markets until they reached the ocean shore,

source: དེ་དག་གིས་ལམ་གྱིས་དུབ་པ་བསལ་ཏེ།
en: where they paused to recover from the weariness of the road.

source: ཟོང་རྙིང་པ་ལྔ་བརྒྱས་གྲུ་བོ་ཆེ་སྦྱར་ནས་ཞོ་ཤས་འཚོ་བ་ལྔ་བརྒྱ་པོ་སྟོབས་པར་བྱེད་པ་དང་། སེལ་བར་བྱེད་པ་དང་། རྐྱལ་ཆེན་དང་། གྲུ་པ་དང་། རླུང་ཡོར་ཐོགས་པ་དག་ཁྲིད་དེ།
en: For five hundred denarii they obtained a ship and hired five hundred crew members to serve as stewards, cleaning staff, divers, deck hands, and riggers.

source: ལན་གསུམ་དྲིལ་བསྒྲགས་ནས་ནོར་བསྒྲུབ་པའི་ཕྱིར་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་སོ། །
en: After calling out three times, they set out upon the ocean in pursuit of riches.

source: ཇི་ཙམ་ན་དེ་དག་རྒྱ་མཚོ་ཆེན་པོར་དོང་བ་དག་གི་གྲུ་བོ་ཆེ་དེ་ཀླུ་རྣམས་ཀྱིས་བཟུང་ནས་
en: Part of the way into their voyage, they and their seafaring ship were held up by nāgas.

source: དེ་དག་ཞི་བ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་ལ་སོགས་པ་ལྷ་རྣམས་ལ་རྒྱ་མཚོ་ཆེན་པོ་འདི་ན་
en: The merchants began to implore Śiva, Varuṇa, Kubera, Śakra, Brahmā, and other gods,

source: ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། དྲི་ཟའམ། གང་གནས་པ་དེ་བདག་ཅག་ལ་ཅི་འདོད་པ་སྨྲ་བར་གྱུར་ཅིག་ཅེས་གསོལ་བ་གདབ་པར་བརྩམས་པ་དང་།
en: “Whoever it is that dwells here, be they gods, nāgas, yakṣas, or gandharvas, may they tell us what they desire!”

source: དེ་ནས་རྒྱ་མཚོ་ཆེན་པོ་ནས་འཕགས་པ་དགེ་འདུན་འཚོ་ངེད་ལ་བྱིན་ཅིག་ཅེས་སྒྲ་ཕྱུང་ངོ་།
en: From the ocean there came a voice, saying, “Give us the noble Saṅgharakṣita!”

source: དེ་དག་གིས་སྨྲས་པ། འཕགས་པ་དགེ་འདུན་འཚོ་ནི་བདག་ཅག་གི་ནེའུ་ལྡངས་ལྷན་ཅིག་སྐྱེས་པ་ས་རྡུལ་ལ་ལྷན་ཅིག་རྩེ་རྩེ་བ། །
en: “The noble Saṅgharakṣita is our peer. We grew up together playing in the dirt with him.

source: བཅོམ་ལྡན་འདས་དང་བཙུན་པ་ཤཱ་རིའི་བུས་བདག་ཅག་ལ་གནང་བ་ཡིན་པ
en: The Blessed One and the venerable Śāriputra have entrusted him to us,

source: ས་བདག་ཅག་འདི་དང་ལྷན་ཅིག་འཆི་བ་དང་དུས་བྱེད་པ་ནི་བླའི། འདི་ཡོངས་སུ་གཏང་བར་ནི་མི་བྱའོ། །
en: so we would sooner die and face our death with him than turn him over.”
